package OOP_by_Java.LordOfRings.Units;

// 50 Имен
public enum Names {
    ФродоБэггинс, СэмуайзГэмджи, МериадокБрендибак, ПерегринТук, Гэндальф,
    Арагорн, Боромир,Гимли,Леголас,Саурон,Саруман,Голлум,БильбоБэггинс,Галадриэль,
    Глоин,РадагастБурый,Теоден,Трандуил,Фарамир,Элронд,Алкарин,Алдарион,Aлмариан,Aльмиел,Aмандил,АсфодельБрендизайк,Aтаналкар,    
    Aтанамир,Aулендил,БораБорондир,БоскоБоффин,Боумен,Бренд,Брандир,Брегалад,Гилдис,Гилдор,ГилГалад,Гимикад,Гимилзагар,Гимилзор, 
    Гирион,Глаурунг,Голдвайн,Горлум,Горбадос,Горбаг,Горбулас,Исембард,Исенгар,Изенгрима,Изилма,Изамбрас,Келебриан,Келебримбор,    
    Келегорм,Кемендур,Кирдан,Кирион,Линдроя,Лобелия,ЛонгоБэггинс,Лони,Лориен,Лагдуш,Мелилот,Мелькор,Менегилда,Менелдор,Мериадок,    
    Меримак,ТоринДубощит,Тилион,Тиндомел,Толмен,Тома,Эсмеральда,ЭстеллаБолджер,Эстелмо,Эверард,Элинел,Эрандир,Эрин;
}
